Cases/Benchmarking/shippingBox_convection_coarse/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// geom.stl
// {
//     extractionMethod    extractFromSurface;

//     // Mark edges whose adjacent surface normals are at an angle less
//     // than includedAngle as features
//     // - 0  : selects no edges
//     // - 180: selects all edges
//     includedAngle       150;

//     // Write options
//     writeFeatureEdgeMesh    yes;

//     // Write features to obj format for postprocessing
//     writeObj                yes;
// }


// ************************************************************************* //
